{
  "modelTopology": {
    "className": "Sequential",
    "kerasVersion": "2.2.4",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "className": "InputLayer",
          "config": {
            "batchInputShape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "className": "Conv2D",
          "config": {
            "filters": 32,
            "kernelSize": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "dataFormat": "channels_last",
            "dilationRate": [1, 1],
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null,
            "name": "conv2d",
            "trainable": true
          }
        }
      ]
    },
    "weightsManifest": []
  },
  "weightsManifest": [],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.15.0",
  "convertedBy": null
}
